In [1]:
import pandas as pd

import os

base_dir = os.getcwd()

In [2]:
# Path for datasets
full_path = base_dir + "\datasets" + "\\"

# Read files
df1 = pd.read_excel(full_path + "Aracaju.xlsx")
df2 = pd.read_excel(full_path + "Fortaleza.xlsx")
df3 = pd.read_excel(full_path + "Natal.xlsx")
df4 = pd.read_excel(full_path + "Recife.xlsx")
df5 = pd.read_excel(full_path + "Salvador.xlsx")

In [3]:
# Concatenate dataframes
df = pd.concat([df1, df2, df3, df4, df5])

In [4]:
# Display first 5 rows
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
# Display last 5 rows
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [6]:
# Display 5 samples
df.sample(5)

     Cidade       Data  Vendas  LojaID  Qtde
94   Recife 2019-01-01   24.70     982     3
150   Natal 2019-01-02   11.13    1035     2
128  Recife 2019-03-02   38.70     982     4
188   Natal 2019-01-02  178.11    1035     3
45   Recife 2019-01-01   15.90     983     8

In [7]:
# Display types of columns
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [8]:
# Change type
df["LojaID"] = df["LojaID"].astype("object")
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [9]:
# Select rows with missing values
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [10]:
# Substitute null values for mean value
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [11]:
# Select rows with missing values
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [12]:
# Substitute null values for mean value
df["Vendas"].fillna(0, inplace=True)

In [13]:
# Remove rows with missing value
df.dropna(inplace=True)

In [14]:
# Remove rows with missing value base on one column
df.dropna(subset=["Vendas"], inplace=True)

In [15]:
# Remove rows with missing value base in all columns
df.dropna(how="all", inplace=True)

In [16]:
# Create new columns
df["Receita"] = df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [17]:
# Create new columns
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [18]:
# Max
df["Receita"].max()

3544.0

In [19]:
# Min
df["Receita"].min()

3.34

In [20]:
# nlargest - top 3 with biggest "Receita"
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [21]:
# nsmallest - top 3 with smalles "Receita"
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [22]:
# Groupby "cidade"
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [23]:
# Order dataset
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0